[
    {
        "Name": "Story 1",
        "ID": 1,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Los datos se segregan por inquilino. Los administradores y usuarios deben estar separados por rol para evitar la divulgación o modificación no autorizada. La información de identificación personal (datos RESTRINGIDOS de la empresa de software) debe estar cifrada en reposo y en tránsito por redes públicas.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "mis datos deben estar protegidos contra la divulgación no intencional a otros clientes o terceros.",
            "So that": ""
        }
    },
    {
        "Name": "Story 2",
        "ID": 2,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que los campos de ingreso de contraseña permiten, o fomentan, el uso de frases secretas, frases de paso largas o contraseñas altamente complejas. Verificar que existan medidas para bloquear el uso de contraseñas comúnmente elegidas y frases secretas débiles.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito que la aplicación permita frases secretas y/o contraseñas complejas.",
            "So that": ""
        }
    },
    {
        "Name": "Story 3",
        "ID": 3,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que todas las conexiones a aplicaciones que contienen información o funciones del cliente estén autenticadas.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito que todas las conexiones a una aplicación que contenga mis datos de usuario estén autenticadas.",
            "So that": ""
        }
    },
    {
        "Name": "Story 4",
        "ID": 4,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que la contraseña y otros campos de ingreso de datos que contienen información RESTRINGIDA no se almacenen en caché ni permitan el autocompletado. Se puede hacer una excepción para los administradores de contraseñas.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito que el ingreso de contraseña y otros campos que contienen información sensible no permitan el almacenamiento en caché ni el autocompletado.",
            "So that": ""
        }
    },
    {
        "Name": "Story 5",
        "ID": 5,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que todas las funciones de autenticación de identidad de la cuenta (como actualizar perfil, contraseña olvidada, token deshabilitado/perdido, mesa de ayuda o IVR) que podrían recuperar el acceso a la cuenta sean al menos tan resistentes a ataques como el mecanismo de autenticación principal. Como mínimo, verificar que la funcionalidad de cambio de contraseña incluya la contraseña anterior, la nueva contraseña y una confirmación de la contraseña. Verificar que la función de contraseña olvidada y otros mecanismos de recuperación no revelen la contraseña actual y que la nueva contraseña no se envíe en texto claro al usuario. Verificar que la contraseña olvidada y otras rutas de recuperación utilicen un TOTP u otro token software, push móvil u otro mecanismo de recuperación sin conexión. El uso de un valor aleatorio en un correo electrónico o SMS debe ser un último recurso.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito la capacidad de cambiar o restablecer mi contraseña de forma segura sin preocuparme de que mis cuentas puedan ser secuestradas por un tercero malicioso.",
            "So that": ""
        }
    },
    {
        "Name": "Story 6",
        "ID": 6,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que las contraseñas de las cuentas estén hash unidireccional con un salt, y que haya suficiente factor de trabajo para derrotar ataques de fuerza bruta y recuperación de hash de contraseña. Verificar que las credenciales se transportan utilizando un enlace cifrado adecuado y que todas las páginas/funciones que requieren que un usuario ingrese credenciales se hagan utilizando un enlace cifrado.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que mis credenciales de cuenta se creen",
            "So that": "almacenen y transporten de forma segura para que no puedan ser adivinadas"
        }
    },
    {
        "Name": "Story 7",
        "ID": 7,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Los usuarios pueden autenticarse mediante autenticación de dos factores u otra autenticación fuerte, o cualquier esquema similar que brinde protección contra la divulgación del nombre de usuario y la contraseña. Verificar que la re-autenticación basada en riesgos, el factor doble o la firma de transacciones estén implementados para transacciones de alto valor.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito un factor adicional de autenticación para proteger mis cuentas del acceso no autorizado. Quiero una autenticación por pasos para transacciones y cambios riesgosos en las cuentas.",
            "So that": ""
        }
    },
    {
        "Name": "Story 8",
        "ID": 8,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Las sesiones se invalidan cuando el usuario cierra la sesión. Verificar que las sesiones expiren después de un período específico de inactividad o después de un período máximo configurable administrativamente independientemente de la actividad (un tiempo de espera absoluto).",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero una función de cierre de sesión de usuario. Necesito que las sesiones de usuario se desactiven después del cierre de sesión y se agoten después de la inactividad o un límite de tiempo establecido por un administrador.",
            "So that": ""
        }
    },
    {
        "Name": "Story 9",
        "ID": 9,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Toda autenticación y re-autenticación exitosa genera una nueva sesión y un identificador de sesión. El identificador de sesión nunca se revela en URL, mensajes de error o registros. Esto incluye verificar que la aplicación no admite la reescritura de URL de las cookies de sesión. Validar que solo los identificadores de sesión generados por el framework de la aplicación sean reconocidos como activos por la aplicación. Confirmar que los identificadores de sesión son lo suficientemente largos,",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "las sesiones de la aplicación deben ser únicas y resistentes al secuestro por parte de un actor malicioso.",
            "So that": ""
        }
    },
    {
        "Name": "Story 10",
        "ID": 10,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Existe el principio de mínimo privilegio: los usuarios solo deberían poder acceder a funciones, archivos de datos, URL, controladores, servicios y otros recursos para los que poseen autorización específica. Esto implica protección contra la suplantación y la elevación de privilegios. El acceso a registros sensibles está restringido, de modo que cada usuario solo pueda acceder a objetos o datos autorizados (por ejemplo, proteger a los usuarios de la manipulación de un parámetro para ver o alterar la cuenta de otro usuario). Si la aplicación es multiinquilino, se debe verificar esta segregación de usuarios y accesos. La aplicación debe usar tokens anti-CSRF aleatorios fuertes o tener otro mecanismo de protección de transacciones.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "las cuentas solo deben poder realizar aquellas acciones o acceder a los recursos que se les hayan otorgado explícitamente.",
            "So that": ""
        }
    },
    {
        "Name": "Story 11",
        "ID": 11,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Validar toda la entrada de datos de una entidad o cliente externo.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que la aplicación valide que la entrada sea correcta y se ajuste al propósito previsto.",
            "So that": ""
        }
    },
    {
        "Name": "Story 12",
        "ID": 12,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Existe una política explícita sobre cómo se gestionan las claves criptográficas (por ejemplo, se generan, distribuyen, revocan y caducan). Verificar que este ciclo de vida de la clave se aplique correctamente. Asegurarse de que los consumidores de servicios criptográficos no tengan acceso directo al material de la clave. Aislar los procesos criptográficos, incluidos los secretos maestros y considerar el uso de una cámara acorazada de claves físicas o virtualizada (HSM).",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito acceso a las claves secretas de la aplicación gestionadas de forma segura.",
            "So that": ""
        }
    },
    {
        "Name": "Story 13",
        "ID": 13,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que todos los números aleatorios, nombres de archivo aleatorios, GUID aleatorios y cadenas aleatorias se generen utilizando el generador de números aleatorios aprobado por el módulo criptográfico cuando estos valores aleatorios están destinados a ser no adivinables por un atacante.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito un nivel adecuado de entropía en la generación de claves para prevenir ataques.",
            "So that": ""
        }
    },
    {
        "Name": "Story 14",
        "ID": 14,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "La aplicación no genera mensajes de error o seguimientos de pila que contengan datos confidenciales que podrían ayudar a un atacante, incluido el identificador de sesión, las versiones de software/framework y la información personal. La aplicación no registra datos confidenciales según lo definido por las leyes o regulaciones de privacidad locales, los datos confidenciales de la organización según lo definido por una evaluación de riesgos, o los datos de autenticación confidenciales que podrían ayudar a un atacante, incluidos los identificadores de sesión de usuario, contraseñas, hashes o tokens API. Los controles de registro de seguridad brindan la capacidad de registrar eventos exitosos y particularmente fallidos que se identifican como relevantes para la seguridad. Cada evento de registro debe incluir la información necesaria que permitiría una investigación detallada de la línea de tiempo cuando ocurre un evento.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero la capacidad de recopilar registros en un formato estándar para un SIEM u otra herramienta de seguridad",
            "So that": "que contenga información como el acceso de usuarios y administradores"
        }
    },
    {
        "Name": "Story 15",
        "ID": 15,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que existe un método para eliminar cada tipo de dato confidencial de la aplicación al final de la política de retención requerida.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero la capacidad de especificar políticas de retención para ciertos datos RESTRINGIDOS o confidenciales para que estos datos puedan eliminarse al final del período de retención.",
            "So that": ""
        }
    },
    {
        "Name": "Story 16",
        "ID": 16,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "La capacidad de limitar el número de intentos de inicio de sesión o enviar alertas cuando se hayan superado los umbrales. Capacidad para enviar alertas cuando un rol intenta una acción más allá del nivel de privilegio o si los intentos de superar el nivel de privilegio alcanzan un umbral.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que la aplicación detecte y alerte cuando haya intentos no autorizados de acceder a mis datos",
            "So that": "iniciar sesión o realizar cambios."
        }
    },
    {
        "Name": "Story 17",
        "ID": 17,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Se registra el acceso o las modificaciones a datos confidenciales, si los datos se recopilan según las directivas de protección de datos relevantes o si se requiere el registro de accesos.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que la aplicación proporcione un registro de auditoría de acciones administrativas",
            "So that": "modificaciones de usuarios o acceso a PII."
        }
    },
    {
        "Name": "Story 18",
        "ID": 18,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que la aplicación utilice métodos apropiados como GET o POST, que se utilicen conjuntos de caracteres seguros, que se observen las políticas de origen único.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "necesito que las aplicaciones web sean resistentes a ataques de actores maliciosos que podrían afectar la disponibilidad o extraer datos y/o credenciales de los usuarios.",
            "So that": ""
        }
    },
    {
        "Name": "Story 19",
        "ID": 19,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Los clientes móviles deben cumplir con el Estándar de Desarrollo de Software Seguro de la empresa de software y se evalúan con el mismo nivel de rigor que otras aplicaciones de la empresa de software.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el cliente móvil aplique el mismo nivel de controles de seguridad que otras aplicaciones de la empresa de software.",
            "So that": ""
        }
    },
    {
        "Name": "Story 20",
        "ID": 20,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "La aplicación móvil no almacena datos confidenciales en recursos compartidos potencialmente no cifrados en el dispositivo (por ejemplo, tarjeta SD o carpetas compartidas). Verificar que los datos confidenciales no se almacenen sin protección en el dispositivo, incluso en áreas protegidas por el sistema como llaveros. La aplicación móvil evita la fuga de información confidencial (por ejemplo, se guardan capturas de pantalla de la aplicación actual cuando la aplicación pasa a segundo plano o se escribe información confidencial en la consola).",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el cliente móvil proteja los datos del usuario.",
            "So that": ""
        }
    },
    {
        "Name": "Story 21",
        "ID": 21,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Los valores de identificación almacenados en el dispositivo y recuperables por otras aplicaciones, como el número UDID o IMEI, no se utilizan como tokens de autenticación. Verificar que las claves secretas, los tokens API o las contraseñas se generen dinámicamente en las aplicaciones móviles.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el cliente móvil utilice métodos de autenticación seguros.",
            "So that": ""
        }
    },
    {
        "Name": "Story 22",
        "ID": 22,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "La aplicación solicita permisos mínimos para la funcionalidad y los recursos requeridos.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el cliente móvil observe el principio de \"mínimo privilegio\".",
            "So that": ""
        }
    },
    {
        "Name": "Story 23",
        "ID": 23,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "El código sensible de la aplicación se presenta de forma impredecible en la memoria (por ejemplo, ASLR) y existen técnicas anti-depuración suficientes para disuadir o retrasar a los atacantes potenciales de inyectar depuradores en la aplicación móvil (por ejemplo, GDB). La aplicación no exporta actividades, intenciones o proveedores de contenido confidenciales para que otras aplicaciones móviles en el mismo dispositivo las exploten. La información confidencial mantenida en la memoria se sobrescribe con ceros tan pronto como ya no se requiera, para mitigar los ataques de volcado de memoria. Verificar que la aplicación valida la entrada a las actividades, intenciones o proveedores de contenido exportados.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el cliente móvil utilice técnicas de codificación seguras.",
            "So that": ""
        }
    },
    {
        "Name": "Story 24",
        "ID": 24,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "El acceso a las funciones de administración y gestión dentro de la aplicación del servicio web está limitado a los administradores del servicio web. Verificar el uso de autenticación y autorización basadas en sesiones. Evitar el uso de \"claves API\" estáticas y similares.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el servicio web implemente una autenticación",
            "So that": "autorización y gestión de sesiones adecuadas."
        }
    },
    {
        "Name": "Story 25",
        "ID": 25,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Se utiliza el mismo estilo de codificación entre el cliente y el servidor. Confirmar que el esquema XML o JSON está en su lugar y se verifica antes de aceptar la entrada. Asegurarse de que toda la entrada esté limitada a un límite de tamaño apropiado. Un servicio REST comprueba explícitamente el Content-Type entrante para que sea el esperado, como application/xml o application/json.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el servicio web valide la entrada.",
            "So that": ""
        }
    },
    {
        "Name": "Story 26",
        "ID": 26,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verificar que los servicios web basados en SOAP cumplan con el perfil básico de interoperabilidad de servicios web (WS-I) como mínimo. Esto esencialmente significa cifrado TLS. Las cargas útiles de los mensajes se firman para garantizar un transporte confiable entre el cliente y el servicio, utilizando JSON Web Signing o WS-Security para solicitudes SOAP. Verificar que no existan rutas de acceso alternativas y menos seguras.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que el servicio web garantice la confidencialidad e integridad de la comunicación.",
            "So that": ""
        }
    },
    {
        "Name": "Story 27",
        "ID": 27,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Usar uno o más de los siguientes: verificaciones ORIGIN, patrón de cookie de doble envío, nonces CSRF y verificaciones de referente.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que un servicio REST esté protegido contra ataques Cross-Site Request Forgery (CSRF).",
            "So that": ""
        }
    },
    {
        "Name": "Story 28",
        "ID": 28,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Todos los componentes deben estar actualizados con las configuraciones y versiones de seguridad adecuadas. Verificar que los componentes de terceros provengan de repositorios confiables.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que todos los componentes de la aplicación tengan bibliotecas y plataformas actualizadas.",
            "So that": ""
        }
    },
    {
        "Name": "Story 29",
        "ID": 29,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Eliminar configuraciones y carpetas innecesarias como aplicaciones de ejemplo, documentación de la plataforma y usuarios predeterminados o de ejemplo. Las comunicaciones entre componentes, como entre el servidor de la aplicación y el servidor de la base de datos, deben estar cifradas, especialmente cuando los",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que la configuración de la aplicación sea \"segura por defecto\".",
            "So that": ""
        }
    },
    {
        "Name": "Story 30",
        "ID": 30,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Validar que las implementaciones de la aplicación estén adecuadamente sandboxeadas, en contenedores o aisladas para retrasar y disuadir a los atacantes de atacar otras aplicaciones. Verificar que los procesos de creación e implementación de la aplicación se realicen de manera segura. Confirmar que todos los activos de la aplicación están alojados por la aplicación en lugar de en un CDN o proveedor externo, incluyendo; bibliotecas JavaScript, hojas de estilo CSS y fuentes web.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "Como Cliente de una empresa de software",
            "I want to": "quiero que la aplicación esté protegida y reforzada por defecto para que los cambios realizados por el usuario no expongan vulnerabilidades de seguridad o fallas en los sistemas subyacentes.",
            "So that": ""
        }
    }
]