[
    {
        "Name": "Story 1",
        "ID": 1,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Data is segregated by tenant. Administrators and users must be separated by role to prevent unauthorized disclosure or modification. Personally identifiable information (RESTRICTED data of the software company) must be encrypted at rest and in transit over public networks.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure my data is protected against unintentional disclosure to other customers or third parties.",
            "So that": ""
        }
    },
    {
        "Name": "Story 2",
        "ID": 2,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that password input fields allow or encourage the use of passphrases, long passphrases, or highly complex passwords. Verify that there are measures to block the use of commonly chosen passwords and weak passphrases.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the application allows for passphrases and/or complex passwords.",
            "So that": ""
        }
    },
    {
        "Name": "Story 3",
        "ID": 3,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that all connections to applications containing client information or functions are authenticated.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that all connections to an application containing my user data are authenticated.",
            "So that": ""
        }
    },
    {
        "Name": "Story 4",
        "ID": 4,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that password and other data entry fields containing RESTRICTED information are not cached or allow autocomplete. An exception can be made for password managers.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that password entry and other fields containing sensitive information do not allow caching or autocomplete.",
            "So that": ""
        }
    },
    {
        "Name": "Story 5",
        "ID": 5,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that all account identity authentication functions (such as updating profile, forgotten password, disabled/lost token, help desk, or IVR) that could regain account access are at least as resistant to attacks as the primary authentication mechanism. At a minimum, verify that the password change functionality includes the old password, the new password, and a password confirmation. Verify that the forgotten password function and other recovery mechanisms do not reveal the current password and that the new password is not sent in clear text to the user. Verify that forgotten password and other recovery routes use a TOTP or other software token, mobile push, or other offline recovery mechanism. Using a random value in an email or SMS should be a last resort.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "have the ability to change or reset my password securely without worrying that my accounts could be hijacked by a malicious third party.",
            "So that": ""
        }
    },
    {
        "Name": "Story 6",
        "ID": 6,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that account passwords are hashed one-way with a salt, and that there is sufficient work factor to defeat brute force and password hash recovery attacks. Verify that credentials are transported using a suitable encrypted link and that all pages/functions requiring a user to enter credentials do so using an encrypted link.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that my account credentials are created",
            "So that": "stored and transported securely so they cannot be guessed."
        }
    },
    {
        "Name": "Story 7",
        "ID": 7,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Users can authenticate using two-factor authentication or other strong authentication, or any similar scheme that provides protection against disclosure of username and password. Verify that risk-based re-authentication, double factor, or transaction signing are implemented for high-value transactions.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "have an additional authentication factor to protect my accounts from unauthorized access. I want step-up authentication for risky transactions and changes in accounts.",
            "So that": ""
        }
    },
    {
        "Name": "Story 8",
        "ID": 8,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Sessions are invalidated when the user logs out. Verify that sessions expire after a specific period of inactivity or after a maximum configurable period independently of activity (an absolute timeout).",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "have a user logout function. I need user sessions to be deactivated after logout and expire after inactivity or an administrator-set time limit.",
            "So that": ""
        }
    },
    {
        "Name": "Story 9",
        "ID": 9,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "All successful authentication and re-authentication generates a new session and session identifier. The session identifier is never revealed in URLs, error messages, or logs. This includes verifying that the application does not support session cookie URL rewriting. Validate that only session identifiers generated by the application framework are recognized as active by the application. Confirm that session identifiers are sufficiently long,",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that application sessions are unique and resistant to hijacking by a malicious actor.",
            "So that": ""
        }
    },
    {
        "Name": "Story 10",
        "ID": 10,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "There is the principle of least privilege: users should only be able to access functions, data files, URLs, controllers, services, and other resources for which they have specific authorization. This implies protection against spoofing and privilege escalation. Access to sensitive logs is restricted, so each user can only access authorized objects or data (e.g., protecting users from parameter tampering to view or alter another user's account). If the application is multi-tenant, this user and access segregation should be verified. The application should use strong random anti-CSRF tokens or have another transaction protection mechanism.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that accounts can only perform actions or access resources that they have been explicitly granted.",
            "So that": ""
        }
    },
    {
        "Name": "Story 11",
        "ID": 11,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Validate all data input from an external entity or client.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the application validates that the input is correct and fits the intended purpose.",
            "So that": ""
        }
    },
    {
        "Name": "Story 12",
        "ID": 12,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "There is an explicit policy on how cryptographic keys are managed (e.g., generated, distributed, revoked, and expired). Verify that this key lifecycle is applied correctly. Ensure that consumers of cryptographic services do not have direct access to the key material. Isolate cryptographic processes, including master secrets, and consider using a physical or virtual key vault (HSM).",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure access to application secret keys is managed securely.",
            "So that": ""
        }
    },
    {
        "Name": "Story 13",
        "ID": 13,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that all random numbers, random file names, random GUIDs, and random strings are generated using the approved random number generator from the cryptographic module when these random values are intended to be non-guessable by an attacker.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure an adequate level of entropy in key generation to prevent attacks.",
            "So that": ""
        }
    },
    {
        "Name": "Story 14",
        "ID": 14,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "The application does not generate error messages or stack traces containing sensitive data that could aid an attacker, including session identifiers, software/framework versions, and personal information. The application does not log sensitive data as defined by local privacy laws or regulations, the organization's sensitive data as defined by a risk assessment, or sensitive authentication data that could aid an attacker, including user session identifiers, passwords, hashes, or API tokens. Security logging controls provide the ability to log successful and particularly failed events identified as relevant to security. Each log event must include the necessary information that would allow a detailed investigation of the timeline when an event occurs.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "have the ability to collect logs in a standard format for a SIEM or other security tool",
            "So that": "that contains information such as user and admin access."
        }
    },
    {
        "Name": "Story 15",
        "ID": 15,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that there is a method to delete each type of sensitive data from the application at the end of the required retention policy.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "have the ability to specify retention policies for certain RESTRICTED or sensitive data so that this data can be deleted at the end of the retention period.",
            "So that": ""
        }
    },
    {
        "Name": "Story 16",
        "ID": 16,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "The ability to limit the number of login attempts or send alerts when thresholds are exceeded. Ability to send alerts when a role attempts an action beyond the privilege level or if attempts to exceed the privilege level reach a threshold.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the application detects and alerts when there are unauthorized attempts to access my data",
            "So that": "log in or make changes."
        }
    },
    {
        "Name": "Story 17",
        "ID": 17,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Access or modifications to sensitive data are logged, if the data is collected according to relevant data protection directives or if access logging is required.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the application provides an audit log of administrative actions",
            "So that": "user modifications or access to PII."
        }
    },
    {
        "Name": "Story 18",
        "ID": 18,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that the application uses appropriate methods such as GET or POST, secure character sets are used, and single-origin policies are observed.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that web applications are resistant to attacks by malicious actors that could affect availability or extract user data and/or credentials.",
            "So that": ""
        }
    },
    {
        "Name": "Story 19",
        "ID": 19,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Mobile clients must comply with the Secure Software Development Standard of the software company and be evaluated with the same level of rigor as other software company applications.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the mobile client applies the same level of security controls as other software company applications.",
            "So that": ""
        }
    },
    {
        "Name": "Story 20",
        "ID": 20,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "The mobile application does not store sensitive data in potentially unencrypted shared resources on the device (e.g., SD card or shared folders). Verify that sensitive data is not stored unprotected on the device, even in system-protected areas such as keychains. The mobile application prevents the leakage of sensitive information (e.g., screenshots of the current application are saved when the application is sent to the background or sensitive information is written to the console).",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the mobile client protects user data.",
            "So that": ""
        }
    },
    {
        "Name": "Story 21",
        "ID": 21,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Identification values stored on the device and retrievable by other applications, such as the UDID or IMEI number, are not used as authentication tokens. Verify that secret keys, API tokens, or passwords are dynamically generated in mobile applications.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the mobile client uses secure authentication methods.",
            "So that": ""
        }
    },
    {
        "Name": "Story 22",
        "ID": 22,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "The application requests minimum permissions for the required functionality and resources.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the mobile client observes the principle of 'least privilege'.",
            "So that": ""
        }
    },
    {
        "Name": "Story 23",
        "ID": 23,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Sensitive application code is presented unpredictably in memory (e.g., ASLR) and sufficient anti-debugging techniques exist to deter or delay potential attackers from injecting debuggers into the mobile application (e.g., GDB). The application does not export activities, intents, or sensitive content providers for other mobile applications on the same device to exploit. Sensitive information held in memory is overwritten with zeros as soon as it is no longer required, to mitigate memory dump attacks. Verify that the application validates input to exported activities, intents, or content providers.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the mobile client uses secure coding techniques.",
            "So that": ""
        }
    },
    {
        "Name": "Story 24",
        "ID": 24,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Access to administration and management functions within the web service application is limited to web service administrators. Verify the use of session-based authentication and authorization. Avoid the use of static 'API keys' and the like.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the web service implements proper authentication,",
            "So that": "authorization, and session management."
        }
    },
    {
        "Name": "Story 25",
        "ID": 25,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "The same coding style is used between the client and server. Confirm that the XML or JSON schema is in place and is verified before accepting input. Ensure that all input is limited to an appropriate size limit. A REST service explicitly checks the incoming Content-Type to be as expected, such as application/xml or application/json.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the web service validates input.",
            "So that": ""
        }
    },
    {
        "Name": "Story 26",
        "ID": 26,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Verify that SOAP-based web services comply with the Web Services Interoperability Basic Profile (WS-I) as a minimum. This essentially means TLS encryption. Message payloads are signed to ensure reliable transport between the client and the service, using JSON Web Signing or WS-Security for SOAP requests. Verify that there are no alternative and less secure access paths.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the web service guarantees the confidentiality and integrity of communication.",
            "So that": ""
        }
    },
    {
        "Name": "Story 27",
        "ID": 27,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Use one or more of the following: ORIGIN checks, double-send cookie pattern, CSRF nonces, and referer checks.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that a REST service is protected against Cross-Site Request Forgery (CSRF) attacks.",
            "So that": ""
        }
    },
    {
        "Name": "Story 28",
        "ID": 28,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "All components should be up to date with appropriate security configurations and versions. Verify that third-party components come from trusted repositories.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that all application components have updated libraries and platforms.",
            "So that": ""
        }
    },
    {
        "Name": "Story 29",
        "ID": 29,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Remove unnecessary configurations and folders such as example applications, platform documentation, and default or sample users. Communications between components, such as between the application server and the database server, must be encrypted, especially when",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the application configuration is 'secure by default'.",
            "So that": ""
        }
    },
    {
        "Name": "Story 30",
        "ID": 30,
        "Assigned To": "",
        "Description": "",
        "Affected Roles": "",
        "Acceptance Criteria": "Validate that application deployments are adequately sandboxed, containerized, or isolated to delay and deter attackers from attacking other applications. Verify that application creation and deployment processes are performed securely. Confirm that all application assets are hosted by the application rather than a CDN or external provider, including; JavaScript libraries, CSS stylesheets, and web fonts.",
        "Status": "",
        "Risk": "",
        "Release": "",
        "Tags": "",
        "Parent Requirement": "",
        "System ID": "",
        "External ID": "",
        "Story": {
            "As a": "As a Customer of a software company",
            "I want to": "ensure that the application is protected and hardened by default so that changes made by the user do not expose security vulnerabilities or failures in underlying systems.",
            "So that": ""
        }
    }
]
